print("\n不足位數補0:%05.3f\n"%(1.732))
print("不足位數填滿空格:%5.3f\n"%(1.732))
print("小數位保留:%3.0f\n"%(1.732))
print("不足位數補0(以字號代替):%0*.3f\n"%(2,1.732))

"ex1"
print("\n不足位數補0:%06.2f\n"%(1.414))
print("不足位數填滿空格:%5.2f\n"%(1.414))
print("小數位保留:%2.2f\n"%(1.414))
print("不足位數補0(字號代替):%0*.3f\n"%(2,2.236))

"ex2"
print("\n不足位數補0:%02.4f\n"%(0.8451))
print("不足位數填滿空格:%3.1f\n"%(0.8451))
print("小數位保留:%2.2f\n"%(0.8451))
print("不足位數補0: %0*.6f\n"%(0,0.8451))

"ex3"
print("%06.5f"%(0.4771))
print("%6.5f"%(0.4771))
print("% .5f"%(0.4771))
print("%0*.7f"%(7,0.4771))
